# GetPointAtStation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GetPointAtStation Method
Alignment Class See Also
---
Calculates the model point for a given alignment station.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public XYZ GetPointAtStation(
	double station
)
```

Visual Basic
---
```text
Public Function GetPointAtStation ( _
	station As Double _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetPointAtStation(
	double station
)
```

# ### Parameters
station
    Type: System..::..DoubleThe alignment station for which to calculate the point, in Revit internal model units (standard Imperial feet).
# ### Return Value
The model point at the given alignment station.
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace